Repository: naserhha/metamask-login
Catalog: languages/*.po
Languages: fa_ir

source: Connect Blockchain Wallet
fa_ir: اتصال کیف پول بلاکچینی

source: Connect your MetaMask wallet to your WordPress account. This will allow you to login with your wallet in the future.
fa_ir: کیف پول متامسک خود را به حساب وردپرس خود متصل کنید. این به شما امکان می‌دهد در آینده با کیف پول خود وارد شوید.

source: Your wallet is already connected:
fa_ir: کیف پول شما قبلاً متصل شده است:

source: Disconnect Wallet
fa_ir: قطع ارتباط کیف پول

source: Security check failed. Please try again.
fa_ir: بررسی امنیتی ناموفق بود. لطفا دوباره تلاش کنید.

source: You must be logged in to disconnect a wallet.
fa_ir: برای قطع اتصال کیف پول باید وارد شوید.

source: Your wallet has been disconnected successfully.
fa_ir: کیف پول شما با موفقیت قطع ارتباط شد.

source: Connecting to MetaMask...
fa_ir: در حال اتصال به متامسک...

source: Please sign the message in MetaMask...
fa_ir: لطفاً پیام را در متامسک امضا کنید...

source: Error
fa_ir: خطا

source: No Web3 wallet detected. Please install MetaMask.
fa_ir: هیچ کیف پول وب3 شناسایی نشد. لطفاً متامسک را نصب کنید.

source: You must be logged in to connect a wallet.
fa_ir: برای اتصال کیف پول باید وارد شوید.

source: Invalid wallet address format.
fa_ir: فرمت آدرس کیف پول نامعتبر است.

source: This wallet is already linked to another account (%s).
fa_ir: این کیف پول قبلاً به حساب دیگری (%s) متصل شده است.

source: I confirm that I am linking this wallet (%s) to my WordPress account (%s). Timestamp: %s Nonce: %s
fa_ir: من تأیید می‌کنم که این کیف پول (%s) را به حساب وردپرس خود (%s) متصل می‌کنم. زمان: %s کد یکبار مصرف: %s

source: Invalid nonce. Please try again.
fa_ir: کد یکبار مصرف نامعتبر است. لطفا دوباره تلاش کنید.

source: Wallet address mismatch. Please try again.
fa_ir: عدم تطابق آدرس کیف پول. لطفا دوباره تلاش کنید.

source: Wallet successfully connected to your account.
fa_ir: کیف پول با موفقیت به حساب شما متصل شد.

source: This wallet is not linked to any account. Please log in via email first and connect your wallet.
fa_ir: این کیف پول به هیچ حسابی متصل نیست. لطفا ابتدا از طریق ایمیل وارد شوید و کیف پول خود را متصل کنید.

source: Registration Method
fa_ir: روش ثبت نام

source: Allow new users to register with MetaMask
fa_ir: به کاربران جدید اجازه دهید با متامسک ثبت نام کنند

source: If unchecked, users must have an existing WordPress account and link their wallet to it before they can login with MetaMask.
fa_ir: اگر علامت نخورد، کاربران باید یک حساب وردپرس موجود داشته باشند و قبل از ورود با متامسک، کیف پول خود را به آن متصل کنند.

source: Welcome, %s
fa_ir: خوش آمدید، %s

source: Username:
fa_ir: نام کاربری:

source: Email:
fa_ir: ایمیل:

source: Blockchain Wallet
fa_ir: کیف پول بلاکچین

source: Blockchain Wallet Information
fa_ir: اطلاعات کیف پول بلاکچین

source: Connected Wallet
fa_ir: کیف پول متصل شده

source: Connected on: %s
fa_ir: متصل شده در: %s

source: No wallet connected
fa_ir: کیف پولی متصل نیست

source: Remove Wallet
fa_ir: حذف کیف پول

source: Wallet has been removed.
fa_ir: کیف پول حذف شده است.

source: MetaMask Wallet Connection
fa_ir: اتصال کیف پول متامسک

source: Connect Your Wallet
fa_ir: کیف پول خود را متصل کنید

source: Connect your MetaMask wallet to your WordPress account to enable secure blockchain login.
fa_ir: کیف پول متامسک خود را به حساب وردپرس خود متصل کنید تا امکان ورود امن با بلاکچین فراهم شود.

source: Connecting your wallet allows you to securely log in to this site using MetaMask.
fa_ir: اتصال کیف پول به شما امکان می‌دهد به صورت امن با استفاده از متامسک وارد این سایت شوید.

source: Manage users who have logged in with MetaMask or connected their wallet. You can change their role from this page.
fa_ir: مدیریت کاربرانی که با متامسک وارد شده‌اند یا کیف پول خود را متصل کرده‌اند. می‌توانید نقش آنها را از این صفحه تغییر دهید.

source: Email
fa_ir: ایمیل

source: Connection Type
fa_ir: نوع اتصال

source: No users have connected a wallet yet.
fa_ir: هنوز هیچ کاربری کیف پول خود را متصل نکرده است.

source: Linked to Existing Account
fa_ir: متصل به حساب موجود

source: MetaMask Registration
fa_ir: ثبت‌نام با متامسک
