Repository: naserhha/metamask-login
Catalog: languages/metamask-login-*.po
Languages: fa_ir

source: MetaMask Login
fa_ir: ورود با متامسک

source: Login to WordPress using MetaMask or other Web3 wallets with admin wallet access control. Supports RTL and Persian language.
fa_ir: ورود به وردپرس با استفاده از متامسک یا کیف پول‌های وب۳ دیگر با کنترل دسترسی کیف پول مدیر. پشتیبانی از RTL و زبان فارسی.

source: Your Name
fa_ir: نام شما

source: Login with MetaMask
fa_ir: ورود با متامسک

source: Connecting...
fa_ir: در حال اتصال...

source: Please sign the message...
fa_ir: لطفاً پیام را امضا کنید...

source: Error
fa_ir: خطا

source: No Web3 wallet detected. Please install MetaMask.
fa_ir: کیف پول Web3 یافت نشد. لطفاً متامسک را نصب کنید.

source: MetaMask Login Settings
fa_ir: تنظیمات ورود متامسک

source: Settings Saved
fa_ir: تنظیمات ذخیره شد

source: Enter Ethereum wallet addresses that should have administrator access. One address per line.
fa_ir: آدرس کیف پول‌های اتریوم که باید دسترسی مدیر داشته باشند را وارد کنید. هر آدرس در یک خط.

source: Admin Wallet Addresses
fa_ir: آدرس کیف پول‌های مدیر

source: Enter one Ethereum wallet address per line (format: 0x...)
fa_ir: در هر خط یک آدرس کیف پول اتریوم وارد کنید (فرمت: ...0x)

source: Default User Role
fa_ir: نقش کاربری پیش‌فرض

source: Role assigned to new users logging in with MetaMask (if not in admin list)
fa_ir: نقش اختصاص داده شده به کاربران جدیدی که با متامسک وارد می‌شوند (اگر در لیست مدیر نباشند)

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Sign this message to authenticate with %s: %s
fa_ir: این پیام را برای احراز هویت با %s امضا کنید: %s

source: Invalid wallet address format
fa_ir: فرمت آدرس کیف پول نامعتبر است

source: Authentication failed: No nonce found
fa_ir: احراز هویت ناموفق: کد یکبار مصرف یافت نشد

source: Authentication failed: Nonce mismatch
fa_ir: احراز هویت ناموفق: عدم تطابق کد یکبار مصرف

source: Authentication successful. Redirecting...
fa_ir: احراز هویت موفق. در حال هدایت...

source: MetaMask User %s
fa_ir: کاربر متامسک %s

source: MetaMask Users
fa_ir: کاربران متامسک

source: Users Management
fa_ir: مدیریت کاربران

source: Role for user %s updated to %s.
fa_ir: نقش برای کاربر %s به %s بروزرسانی شد.

source: Manage users who have logged in with MetaMask. You can change their role from this page.
fa_ir: مدیریت کاربرانی که با متامسک وارد شده‌اند. می‌توانید نقش آن‌ها را از این صفحه تغییر دهید.

source: Username
fa_ir: نام کاربری

source: Display Name
fa_ir: نام نمایشی

source: Wallet Address
fa_ir: آدرس کیف پول

source: Current Role
fa_ir: نقش فعلی

source: Actions
fa_ir: عملیات‌ها

source: No users have logged in with MetaMask yet.
fa_ir: هنوز هیچ کاربری با متامسک وارد نشده است.

source: Change Role
fa_ir: تغییر نقش

source: Blockchain Dashboard
fa_ir: داشبورد بلاکچین

source: You must be logged in to view this dashboard.
fa_ir: برای مشاهده این داشبورد باید وارد شوید.

source: No wallet address found for your account.
fa_ir: هیچ آدرس کیف پولی برای حساب شما یافت نشد.

source: Welcome, %s
fa_ir: خوش آمدید، %s

source: Your Wallet
fa_ir: کیف پول شما

source: Wallet Address:
fa_ir: آدرس کیف پول:

source: Blockchain Information
fa_ir: اطلاعات بلاکچین

source: Loading blockchain data...
fa_ir: در حال بارگیری اطلاعات بلاکچین...

source: Network:
fa_ir: شبکه:

source: ETH Balance:
fa_ir: موجودی اتریوم:

source: Recent Transactions:
fa_ir: تراکنش‌های اخیر:

source: View
fa_ir: مشاهده

source: Error fetching blockchain data. Please make sure your wallet is connected.
fa_ir: خطا در دریافت اطلاعات بلاکچین. لطفاً مطمئن شوید که کیف پول شما متصل است.

source: MetaMask or ethers.js not detected. Please install MetaMask and refresh the page.
fa_ir: متامسک یا ethers.js پیدا نشد. لطفاً متامسک را نصب کرده و صفحه را بارگذاری مجدد کنید.

source: Connect your Web3 wallet to login
fa_ir: برای ورود، کیف پول Web3 خود را متصل کنید

source: User Dashboard
fa_ir: داشبورد کاربری

source: Profile
fa_ir: پروفایل

source: Security
fa_ir: امنیت

source: Privacy
fa_ir: حریم خصوصی

source: Activity
fa_ir: فعالیت‌ها

source: Statistics
fa_ir: آمار

source: Phone Number
fa_ir: شماره تلفن

source: Email Address
fa_ir: آدرس ایمیل

source: Update Profile
fa_ir: به‌روزرسانی پروفایل

source: Security Settings
fa_ir: تنظیمات امنیتی

source: Password
fa_ir: رمز عبور

source: Change Password
fa_ir: تغییر رمز عبور

source: Two-Factor Authentication
fa_ir: احراز هویت دو مرحله‌ای

source: Enabled
fa_ir: فعال

source: Disabled
fa_ir: غیرفعال

source: Blockchain Authentication
fa_ir: احراز هویت بلاکچین

source: Connected Wallet:
fa_ir: کیف پول متصل:

source: Disconnect
fa_ir: قطع اتصال

source: Privacy Settings
fa_ir: تنظیمات حریم خصوصی

source: Show email to other users
fa_ir: نمایش ایمیل به سایر کاربران

source: Show phone number to other users
fa_ir: نمایش شماره تلفن به سایر کاربران

source: Show activity history to other users
fa_ir: نمایش تاریخچه فعالیت به سایر کاربران

source: Save Privacy Settings
fa_ir: ذخیره تنظیمات حریم خصوصی

source: Activity History
fa_ir: تاریخچه فعالیت‌ها

source: All Activities
fa_ir: همه فعالیت‌ها

source: Logins
fa_ir: ورودها

source: Profile Updates
fa_ir: به‌روزرسانی‌های پروفایل

source: Security Changes
fa_ir: تغییرات امنیتی

source: Last 7 Days
fa_ir: ۷ روز گذشته

source: Last 30 Days
fa_ir: ۳۰ روز گذشته

source: Last 90 Days
fa_ir: ۹۰ روز گذشته

source: No activity history available.
fa_ir: هیچ تاریخچه فعالیتی موجود نیست.

source: Views
fa_ir: بازدیدها

source: Revenue
fa_ir: درآمد

source: Orders
fa_ir: سفارش‌ها

source: Customers
fa_ir: مشتریان

source: Sales
fa_ir: فروش

source: Marketing
fa_ir: بازاریابی

source: Products
fa_ir: محصولات

source: Reports
fa_ir: گزارش‌ها

source: Settings
fa_ir: تنظیمات

source: Activity Chart
fa_ir: نمودار فعالیت

source: User Activity
fa_ir: فعالیت کاربر

source: Farvardin
fa_ir: فروردین

source: Ordibehesht
fa_ir: اردیبهشت

source: Khordad
fa_ir: خرداد

source: Tir
fa_ir: تیر

source: Mordad
fa_ir: مرداد

source: Shahrivar
fa_ir: شهریور

source: MetaMask Settings
fa_ir: تنظیمات متامسک

source: Login Button Text
fa_ir: متن دکمه ورود

source: This text appears below the MetaMask login button.
fa_ir: این متن در زیر دکمه ورود با متامسک نمایش داده می‌شود.

source: Shortcode Documentation
fa_ir: راهنمای شورت‌کدها

source: User Dashboard Shortcode
fa_ir: شورت‌کد داشبورد کاربری

source: This shortcode displays the complete user dashboard with the following features:
fa_ir: این شورت‌کد داشبورد کامل کاربری را نمایش می‌دهد که شامل موارد زیر است:

source: User profile and information editing
fa_ir: پروفایل کاربر و ویرایش اطلاعات

source: Security settings and two-factor authentication
fa_ir: تنظیمات امنیتی و احراز هویت دو مرحله‌ای

source: Privacy settings
fa_ir: تنظیمات حریم خصوصی

source: Activity history
fa_ir: تاریخچه فعالیت‌ها

source: Statistics and charts
fa_ir: آمار و نمودارها

source: Usage Example:
fa_ir: مثال استفاده:

source: Wallet Connect Button Shortcode
fa_ir: شورت‌کد دکمه اتصال کیف پول

source: This shortcode displays a button to connect MetaMask wallet.
fa_ir: این شورت‌کد یک دکمه برای اتصال کیف پول متامسک نمایش می‌دهد.

source: Parameters:
fa_ir: پارامترها:

source: Button text (default: "Connect Wallet")
fa_ir: متن دکمه (پیش‌فرض: "اتصال به کیف پول")

source: Additional CSS class
fa_ir: کلاس CSS اضافی

source: Wallet Address Display Shortcode
fa_ir: شورت‌کد نمایش آدرس کیف پول

source: This shortcode displays the user's connected wallet address.
fa_ir: این شورت‌کد آدرس کیف پول متصل شده کاربر را نمایش می‌دهد.

source: Show copy button (true/false)
fa_ir: نمایش دکمه کپی (true/false)

source: Show balance (true/false)
fa_ir: نمایش موجودی (true/false)

source: Profile Form Shortcode
fa_ir: شورت‌کد فرم پروفایل

source: This shortcode displays the user profile editing form.
fa_ir: این شورت‌کد فرم ویرایش پروفایل کاربر را نمایش می‌دهد.

source: Show wallet section (true/false)
fa_ir: نمایش بخش کیف پول (true/false)

source: Show avatar (true/false)
fa_ir: نمایش آواتار (true/false)

source: Activity Log Shortcode
fa_ir: شورت‌کد تاریخچه فعالیت‌ها

source: This shortcode displays the user's activity history.
fa_ir: این شورت‌کد تاریخچه فعالیت‌های کاربر را نمایش می‌دهد.

source: Number of items (default: 10)
fa_ir: تعداد موارد (پیش‌فرض: 10)

source: Show filters (true/false)
fa_ir: نمایش فیلترها (true/false)

source: Activity Chart Shortcode
fa_ir: شورت‌کد نمودار فعالیت

source: This shortcode displays the user's activity chart.
fa_ir: این شورت‌کد نمودار فعالیت‌های کاربر را نمایش می‌دهد.

source: Chart type (line/bar)
fa_ir: نوع نمودار (line/bar)

source: Number of days to display (default: 30)
fa_ir: تعداد روزهای نمایش (پیش‌فرض: 30)
